# tap various cask repositories before installing
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-drivers"

brew "fnm"
brew "mas"

cask "1password"
cask "ledger-live"
cask "brave-browser"
cask "discord"
cask "github"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp-beta"
cask "monitorcontrol"
cask "blackhole-2ch"
cask "obs"
cask "flutter"
cask "notion"
cask "fantastical"
cask "gpg-suite-no-mail"
cask "protonmail-bridge"
cask "spotify"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
