# tap various cask repositories before installing
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-drivers"

brew "fnm"
brew "mas"

cask "1password"
cask "ledger-live"
cask "librewolf"
cask "github-beta"
cask "visual-studio-code"
cask "vlc"
cask "monitorcontrol"
cask "blackhole-2ch"
cask "obs"
cask "flutter"
cask "notion"
cask "fantastical"
cask "gpg-suite-no-mail"
cask "spotify"
cask "insomnia"
cask "calibre"
cask "discord"
cask "whatsapp"
cask "messenger"
cask "tunnelblick"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
mas "Ikea Home smart", id: 1195836071
mas "Xiaomi Home - xiaomi smarthome", id: 957323480
mas "Bitwarden", id: 1352778147